---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIsTooClosedToGridlines
source: html/08b2e534-f9ac-c1c2-a19d-19ca12a793d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIsTooClosedToGridlines Property

A chain formed by these curve elements defines a splitter which lies too close to gridlines and will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainIsTooClosedToGridlines { get; }
```